<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Importing-Data" data-toc-modified-id="Importing-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Importing Data</a></span></li><li><span><a href="#Cleaning/Wrangling/EDA" data-toc-modified-id="Cleaning/Wrangling/EDA-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Cleaning/Wrangling/EDA</a></span></li></ul></div>

# Importing Data

In [19]:
import pandas as pd
import numpy as np

In [49]:
data = pd.read_csv('alldata.csv')

In [50]:
data=data.dropna(how='all')

In [51]:
data.head(2)

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"

In [52]:
data.reset_index(drop=True,inplace=True)

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6953 entries, 0 to 6952
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     6953 non-null   object
 1   company      6953 non-null   object
 2   description  6953 non-null   object
 3   reviews      5326 non-null   float64
 4   location     6953 non-null   object
dtypes: float64(1), object(4)
memory usage: 271.7+ KB

In [54]:
data.describe(include='all')

,position,company,description,reviews,location
count,6953,6953,6953,5326.000000,6953
unique,5242,2213,6708,NaN,382
top,Data Scientist,Amazon.com,Note: By applying to this position your applic...,NaN,"Seattle, WA"
freq,351,358,9,NaN,563
mean,NaN,NaN,NaN,3179.089185,NaN
std,NaN,NaN,NaN,8448.515056,NaN
min,NaN,NaN,NaN,2.000000,NaN
25%,NaN,NaN,NaN,27.000000,NaN
50%,NaN,NaN,NaN,230.000000,NaN
75%,NaN,NaN,NaN,1578.000000,NaN
max,NaN,NaN,NaN,148114.000000,NaN

# Observations:
- we neeed to standardise the city
-

# Cleaning/Wrangling/EDA

In [55]:
# checking for duplicates rows
data[data.duplicated()]

Empty DataFrame
Columns: [position, company, description, reviews, location]
Index: []

In [56]:
df=data
df.head(5)

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"

In [57]:
print('Position unique value is',df['position'].nunique())
print('Company unique value is',df['company'].nunique())
print('Description unique value is',df['description'].nunique())
print('Reviews unique value is',df['reviews'].nunique())
print('Location unique value is',df['location'].nunique())

Position unique value is 5242
Company unique value is 2213
Description unique value is 6708
Reviews unique value is 560
Location unique value is 382

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6953 entries, 0 to 6952
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   position     6953 non-null   object
 1   company      6953 non-null   object
 2   description  6953 non-null   object
 3   reviews      5326 non-null   float64
 4   location     6953 non-null   object
dtypes: float64(1), object(4)
memory usage: 271.7+ KB

In [62]:
df['reviews'].isna().sum()

1627

In [68]:
df['position'].value_counts().head(10).sort_values(ascending=True)

Data Analyst                  22
Principal Data Scientist      24
Sr. Data Scientist            28
Research Scientist            30
Lead Data Scientist           31
Machine Learning Engineer     56
Data Engineer                 60
Research Analyst              64
Senior Data Scientist         96
Data Scientist               351
Name: position, dtype: int64

In [69]:
df['reviews'].fillna("0")

0           0
1           0
2           0
3          44
4         550
        ...
6948      574
6949       26
6950        5
6951     4618
6952    11610
Name: reviews, Length: 6953, dtype: object